// ********************************************************************************* 
// 文件名: proc_gray_median_filter.v   
// 创建人: 梁辉鸿
// 创建日期: 2021.3.25
// 联系方式: 17hhliang3@stu.edu.cn
// --------------------------------------------------------------------------------- 
// 模块名: proc_gray_median_filter
// 发布版本号: V0.0
// --------------------------------------------------------------------------------- 
// 功能说明: 1)图像处理算法模块--灰度图中值滤波
// 
// --------------------------------------------------------------------------------- 
// 变更描述:
//    
// ---------------------------------------------------------------------------------
// 发布记录:
//  			  
// ---------------------------------------------------------------------------------
// *********************************************************************************


// ---------------------------------------------------------------------------------
// 引用文件 Include File
// --------------------------------------------------------------------------------- 

// ---------------------------------------------------------------------------------
// 仿真时间 Simulation Timescale
// ---------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------
// 常量参数 Constant Parameters
// ---------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------
// 模块定义 Module Define
// --------------------------------------------------------------------------------- 
module proc_gray_median_filter
(
    // clock & reset
    input 			    clk,	                //时钟信号
    input               rst_n,                  //复位信号, 低电平有效

    // input signal
    // 图像处理前的数据接口
    input               ycbcr_vs,               //vsync信号
    input               ycbcr_hs,               //hsync信号
    input               ycbcr_de,               //data enable信号
    input      [ 7 : 0] ycbcr_y,                //灰度数据
    
    // output signal
    // 图像处理后的数据接口
    output              median_vs,              //vsync信号
    output              median_hs,              //hsync信号
    output              median_de,              //data enable信号
    output     [ 7 : 0] median_y                //中值滤波后的灰度数据
);

// ---------------------------------------------------------------------------------
// 局部常量 Local Constant Parameters
// ---------------------------------------------------------------------------------

   
// ---------------------------------------------------------------------------------
// 模块内变量定义 Module_Variables
// --------------------------------------------------------------------------------- 
    wire                matrix_vs;              //vsync信号
    wire                matrix_hs;              //hsync信号
    wire                matrix_de;              //data enable信号
    wire       [ 7 : 0] matrix_p11;             //矩阵像素(1,1)
    wire       [ 7 : 0] matrix_p12;             //矩阵像素(1,2)
    wire       [ 7 : 0] matrix_p13;             //矩阵像素(1,3)
    wire       [ 7 : 0] matrix_p21;             //矩阵像素(2,1)
    wire       [ 7 : 0] matrix_p22;             //矩阵像素(2,2)
    wire       [ 7 : 0] matrix_p23;             //矩阵像素(2,3)
    wire       [ 7 : 0] matrix_p31;             //矩阵像素(3,1)
    wire       [ 7 : 0] matrix_p32;             //矩阵像素(3,2)
    wire       [ 7 : 0] matrix_p33;             //矩阵像素(3,3)
    
    wire       [ 7 : 0] median_result;          //中值滤波器输出结果
    
// ---------------------------------------------------------------------------------
// 数据流描述 Continuous Assignments
// ---------------------------------------------------------------------------------    
    assign  median_y = median_hs? median_result : 8'd0;

// ---------------------------------------------------------------------------------
// 行为描述 Clocked Assignments
// ---------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------
// 结构化描述 Moudle Instantiate
// ---------------------------------------------------------------------------------
    // 3X3灰度矩阵生成模块
    matrix_gen_3x3_8b       U1_matrix_gen_3x3_8b
    (
        // clock & reset
        .clk	                        (clk),
        .rst_n                          (rst_n),
        
        // input signal
        .ycbcr_vs                       (ycbcr_vs),
        .ycbcr_hs                       (ycbcr_hs),
        .ycbcr_de                       (ycbcr_de),
        .ycbcr_y                        (ycbcr_y),

        // output signal
        .matrix_vs                      (matrix_vs),
        .matrix_hs                      (matrix_hs),
        .matrix_de                      (matrix_de),
        .matrix_p11                     (matrix_p11),
        .matrix_p12                     (matrix_p12),
        .matrix_p13                     (matrix_p13),
        .matrix_p21                     (matrix_p21),
        .matrix_p22                     (matrix_p22),
        .matrix_p23                     (matrix_p23),
        .matrix_p31                     (matrix_p31),
        .matrix_p32                     (matrix_p32),
        .matrix_p33                     (matrix_p33)
    );
    
    // 3x3矩阵的中值滤波器
    median_filter_3x3       U_median_filter_3x3
    (
        // clock & reset
        .clk	                        (clk),
        .rst_n                          (rst_n),

        // input signal
        .matrix_vs                      (matrix_vs),
        .matrix_hs                      (matrix_hs),
        .matrix_de                      (matrix_de),
        .matrix_p11                     (matrix_p11),
        .matrix_p12                     (matrix_p12),
        .matrix_p13                     (matrix_p13),
        .matrix_p21                     (matrix_p21),
        .matrix_p22                     (matrix_p22),
        .matrix_p23                     (matrix_p23),
        .matrix_p31                     (matrix_p31),
        .matrix_p32                     (matrix_p32),
        .matrix_p33                     (matrix_p33),

        // output signal
        .median_vs                      (median_vs),
        .median_hs                      (median_hs),
        .median_de                      (median_de),
        .median_y                       (median_result)
    );
    
// ---------------------------------------------------------------------------------
// 任务定义 Called Tasks
// ---------------------------------------------------------------------------------

	
// ---------------------------------------------------------------------------------
// 函数定义 Called Functions
// ---------------------------------------------------------------------------------

    
endmodule