// *********************************************************************************
// 文件名: i2c_ov5640_cfg.v   
// 创建人: 梁辉鸿
// 创建日期: 2021.4.2
// 联系方式: 17hhliang3@stu.edu.cn
// --------------------------------------------------------------------------------- 
// 模块名: i2c_ov5640_cfg
// 发布版本号: V0.0
// --------------------------------------------------------------------------------- 
// 功能说明: 1)OV5640寄存器配置的顶层模块
// 
// --------------------------------------------------------------------------------- 
// 变更描述:     
//    
// ---------------------------------------------------------------------------------
// 发布记录: 	 
//
// ---------------------------------------------------------------------------------
// *********************************************************************************


// ---------------------------------------------------------------------------------
// 引用文件 Include File
// --------------------------------------------------------------------------------- 

// ---------------------------------------------------------------------------------
// 仿真时间 Simulation Timescale
// ---------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------
// 常量参数 Constant Parameters
// ---------------------------------------------------------------------------------

// ---------------------------------------------------------------------------------
// 模块定义 Module Define
// --------------------------------------------------------------------------------- 
module i2c_ov5640_cfg
(
    // clock & reset
    input               clk,                    //时钟
	input 			    rst_n,  		        //复位信号, 低电平有效

    // input signal
    
    
    // output signal
    output              cam_init_done,
    output              cam_scl,
    output              cam_sda
);

// ---------------------------------------------------------------------------------
// 局部常量 Local Constant Parameters
// ---------------------------------------------------------------------------------
    localparam   SLAVE_ADDR    = 7'h3c;              //OV5640的器件地址为7'h3c
    localparam   BIT_CTRL      = 1'b1;               //OV5640的字节地址为16位, 8位(0)/16位(1)
    localparam   CLK_FREQ      = 27'd100_000_000;    //i2c_controller模块的驱动时钟频率
    localparam   I2C_FREQ      = 18'd250_000;        //I2C的SCL时钟频率, 不超过400KHz

    localparam   CMOS_H_PIXEL  = 13'd480;            //CMOS水平方向像素个数
    localparam   CMOS_V_PIXEL  = 13'd272;            //CMOS垂直方向像素个数
    localparam   TOTAL_H_PIXEL = 13'd1800;           //水平总像素大小
    localparam   TOTAL_V_PIXEL = 13'd1000;           //垂直总像素大小
    localparam   CMOS_HV_SIZE  = 24'd130560;         //CMOS输出图像的大小, CMOS_H_PIXEL * CMOS_V_PIXEL
                                                     //用于配置写SDRAM的最大地址

// ---------------------------------------------------------------------------------
// 模块内变量定义 Module_Variables
// --------------------------------------------------------------------------------- 
    wire            i2c_dri_clk;  
    wire            i2c_exec;  
    wire            i2c_rw_ctrl;  
    wire            i2c_done;     
    wire   [ 7 : 0] i2c_rd_data;  
    wire   [23 : 0] i2c_data;   
    
// ---------------------------------------------------------------------------------
// 数据流描述 Continuous Assignments
// --------------------------------------------------------------------------------- 

    
// ---------------------------------------------------------------------------------
// 行为描述 Clocked Assignments
// ---------------------------------------------------------------------------------


// ---------------------------------------------------------------------------------
// 结构化描述 Moudle Instantiate
// ---------------------------------------------------------------------------------
    // IIC 配置模块
    i2c_ov5640_rgb565_cfg
    #(
        // parameter passing
        .CMOS_H_PIXEL           (CMOS_H_PIXEL),
        .CMOS_V_PIXEL           (CMOS_V_PIXEL),
        .TOTAL_H_PIXEL          (TOTAL_H_PIXEL),
        .TOTAL_V_PIXEL          (TOTAL_V_PIXEL),
        .CMOS_HV_SIZE           (CMOS_HV_SIZE)
    )
    U_i2c_ov5640_rgb565_cfg
    (
        // clock & reset
        .clk	                (i2c_dri_clk),
        .rst_n  		        (rst_n),

        // input signal
        .i2c_done               (i2c_done),
        .i2c_rd_data            (i2c_rd_data),

        // output signal
        .i2c_exec               (i2c_exec),
        .i2c_init_done          (cam_init_done),
        .i2c_rw_ctrl            (i2c_rw_ctrl),
        .i2c_data               (i2c_data)
    );
    
    // IIC 驱动模块
    i2c_controller
    #(
        // parameter passing
        .SLAVE_ADDR             (SLAVE_ADDR),
        .CLK_FREQ               (CLK_FREQ),
        .I2C_FREQ               (I2C_FREQ)
    )
    U_i2c_controller
    (
        // clock & reset
        .clk                    (clk),
        .rst_n	                (rst_n),

        // i2c interface
        .i2c_exec               (i2c_exec),
        .bit_ctrl               (BIT_CTRL),
        .i2c_rw_ctrl            (i2c_rw_ctrl),
        .i2c_addr               (i2c_data[23 : 8]),
        .i2c_wr_data            (i2c_data[ 7 : 0]),
        .i2c_rd_data            (i2c_rd_data),
        .i2c_done               (i2c_done),
        .scl                    (cam_scl),
        .sda                    (cam_sda),

        // user interface
        .clk_dri                (i2c_dri_clk)
    );

// ---------------------------------------------------------------------------------
// 任务定义 Called Tasks
// ---------------------------------------------------------------------------------
    
	
// ---------------------------------------------------------------------------------
// 函数定义 Called Functions
// ---------------------------------------------------------------------------------

    
endmodule 